Catalogs/бит_Квартиры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_Квартиры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.бит_СписокЗданий</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Этаж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКомнат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКвартиры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксКвартиры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоБТИ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КадастровыйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПодъезда</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальныйНомерГИСЖКХ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подъезд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Подъезды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодтвержденоПоставщиком</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_НомерКвартирыДляСортировки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/бит_СведенияОКомнате.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СведенияОКомнате</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Площадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Комната</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Комнаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_СведенияОКвартире.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СведенияОКвартире</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбщаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖилаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МОП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтапливаемаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СовокупнаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПлиты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыПлиты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗапирающегоУстройства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыЗапирающихУстройств</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖилоеПомещениеСпециализированногоЖилищногоФонда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлощадьОДНСОИЭлектроснаб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлощадьОДНСОИВодоснаб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВысотаПотолков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ПредставлениеКвартиры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ИгнорироватьСальдоСвоихУслуг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_НеВыводитьСтрокуДомофон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ПлощадьКапремонта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/бит_ПринадлежностьКомнат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ПринадлежностьКомнат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Внешняя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Внутренняя</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/бит_Комнаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_Комнаты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.бит_Квартиры</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерКомнаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧастьПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_НазначениеЧастейПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонКвартир</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ШаблоныКвартир</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КадастровыйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальныйНомерГИСЖКХ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодтвержденоПоставщиком</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сведения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Высота</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Площадь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/бит_Квартиры/Forms/ФормаЭлементаУправляемая/Ext/Form/Module.bsl
#Область ОбщиеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
	
	// Список цифр
	СписокЦифр = Новый СписокЗначений;
	
	Для Значение = 48 По 57 Цикл
		
		СписокЦифр.Добавить(Значение);	
		
	КонецЦикла;
	
	// Буквы русского,англиского алфавита, 
	СписокКодовБукв = Новый СписокЗначений;
	
	Для Значение = 1040 По 1103 Цикл
		
		СписокКодовБукв.Добавить(Значение);
		
	КонецЦикла;
	
	Для Значение = 65 По 90 Цикл
		
		СписокКодовБукв.Добавить(Значение);
		
	КонецЦикла;
	
	Для Значение = 97 По 122 Цикл
		
		СписокКодовБукв.Добавить(Значение);
		
	КонецЦикла;
	
	СписокКодовБукв.Добавить(45);
	СписокКодовБукв.Добавить(47);
	СписокКодовБукв.Добавить(95);
	СписокКодовБукв.Добавить(33);
	СписокКодовБукв.Добавить(32);
	СписокКодовБукв.Добавить(46);
	СписокКодовБукв.Добавить(44);
	
	КэшированныеЗначения.Вставить("СписокЦифр"     , СписокЦифр);
	КэшированныеЗначения.Вставить("СписокКодовБукв", СписокКодовБукв);
	КэшированныеЗначения.Вставить("ЭтоНовый"       , ?(Параметры.Ключ.Пустая(), Истина, Ложь));
	
	КэшированныеЗначения.Вставить("ТипКвартиры", Неопределено);
	
КонецПроцедуры

// Процедура устанавливает отборы 
//
&НаСервере
Процедура УстановитьОтборы()
	
	СведенияОКвартире.Отбор.Элементы.Очистить();
	
	Эл = СведенияОКвартире.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Квартира");
	Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
	Эл.ПравоеЗначение   = Объект.Ссылка;
	Эл.Использование    = Истина;
	Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	Если ЗначениеЗаполнено(НаДату) Тогда
		
		Эл = СведенияОКвартире.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Период");
		Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
		Эл.ПравоеЗначение   = НаДату;
		Эл.Использование    = Истина;
		Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
	КонецЕсли; 
	
КонецПроцедуры

// Процедура расчета различных типов площадей для сравнения и контроля аналогичных в справочнике Квартиры.
//
&НаСервере
Процедура ПосчитатьПлощади()
	
	ТабличноеПолеПлощадей.Очистить();
	
	Массив = Новый Массив;
	
	Массив.Вставить(0,"Общая площадь");
	Массив.Вставить(1,"Жилая площадь");
	Массив.Вставить(2,"МОП площадь");
	Массив.Вставить(3,"Отапливаемая площадь");
	Массив.Вставить(4,"Совокупная площадь");
	
	Площадь = Новый Массив(5);
	
	Для Счетчик = 0 По 4  Цикл
		
		Площадь[Счетчик] = 0;
		
	КонецЦикла; 
	
	СписокКомнат = ПолучитьСписокКомнат(Объект.Ссылка, НаДату);
	
	Для каждого СтрокаТЧ Из СписокКомнат Цикл
		
		Строка = СтрокаТЧ.Комната.ЧастьПомещения;
		
		Если Строка.КоэффициентНачислений <> 0 Тогда
			
			// Отапливаемая
			Площадь[3] = Площадь[3] + СтрокаТЧ.Площадь;
			
			Если Строка.Принадлежность = Перечисления.бит_ПринадлежностьКомнат.Внутренняя Тогда
				
				// Общая
				Площадь[0] = Площадь[0] + СтрокаТЧ.Площадь;
				
				Если Строка.ТипКомнаты = Справочники.бит_ТипыКомнат.Жилая Тогда
					
					// Жилая
					Площадь[1] = Площадь[1] + СтрокаТЧ.Площадь;
					
				КонецЕсли;	
				
			КонецЕсли;
			
		КонецЕсли;	
		
		Если Строка.ТипКомнаты = Справочники.бит_ТипыКомнат.МОП Тогда
			
			// МОП
			Площадь[2] = Площадь[2] + СтрокаТЧ.Площадь;
			
		КонецЕсли;
		
		// Совокупная
		Площадь[4] = Площадь[4] + СтрокаТЧ.Площадь;
		
	КонецЦикла;                                                                    
	
	ПлощадиКвартиры = ВывестиПлощадиКвартиры(Объект.Ссылка, НаДату);
	
	Если ЗначениеЗаполнено(ПлощадиКвартиры) Тогда
		
		Для Счетчик = 0 По 4 Цикл
			
			НоваяСтрока = ТабличноеПолеПлощадей.Добавить();
			
			НоваяСтрока.ВидыПлощадей    = Массив[Счетчик]; 
			НоваяСтрока.ПлощадиКвартиры = ПлощадиКвартиры[Счетчик];
			НоваяСтрока.ПлощадиКомнат   = Площадь[Счетчик];
			
		КонецЦикла;
		
	ИначеЕсли НЕ мКэшЗначений.ЭтоНовый Тогда
		
		// БИТ_ЖКХ 02.03.2015{{
		// Сообщить("Нет исходных данных по площадям квартиры! Проверьте регистр сведений ""Сведения о квартире""",СтатусСообщения.Важное);
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Нет исходных данных по площадям квартиры! Проверьте регистр сведений ""Сведения о квартире""";
		Сообщение.Сообщить();
		// БИТ_ЖКХ 02.03.2015}}
		
	КонецЕсли;
	
КонецПроцедуры

// Функция формирования списка комнат квартиры на дату.
&НаСервереБезКонтекста
Функция ПолучитьСписокКомнат(Знач НомерКвартиры, Знач НаДату)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_СведенияОКомнатеСрезПоследних.Комната,
	|	бит_СведенияОКомнатеСрезПоследних.Площадь
	|ИЗ
	|	РегистрСведений.бит_СведенияОКомнате.СрезПоследних(&Момент, Комната.Владелец = &Владелец) КАК бит_СведенияОКомнатеСрезПоследних"; 
	
	Запрос.УстановитьПараметр("Владелец", НомерКвартиры);
	Запрос.УстановитьПараметр("Момент"  , НаДату);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

// Функция формирования структуры из площадей квартиры.
//
// Параметры
//  <НомерКвартиры>  - ссылка на квартиру
//                 в регистре сведений.
//
// Возвращаемое значение:
//  <ИскомыйРезультат.Структура> - набор данных по площадям.
//
&НаСервереБезКонтекста
Функция ВывестиПлощадиКвартиры(Знач НомерКвартиры, Знач НаДату)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.ЖилаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.МОП,
	|	бит_СведенияОКвартиреСрезПоследних.ОтапливаемаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.СовокупнаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.Квартира
	|ИЗ
	|	РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&ТекущаяДата, Квартира = &Квартира) КАК бит_СведенияОКвартиреСрезПоследних";
	
	Запрос.УстановитьПараметр("Квартира"   , НомерКвартиры);
	Запрос.УстановитьПараметр("ТекущаяДата", НаДату);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Отбор = Новый Структура();
	
	Отбор.Вставить("Квартира",НомерКвартиры);
	
	Строки = Результат.НайтиСтроки(Отбор);
	
	Если Строки.Количество() > 0 Тогда
		
		ИскомыйРезультат = Новый Массив;
		
		ИскомыйРезультат.Вставить(0,Строки[0].ОбщаяПлощадь);
		ИскомыйРезультат.Вставить(1,Строки[0].ЖилаяПлощадь);
		ИскомыйРезультат.Вставить(2,Строки[0].МОП);
		ИскомыйРезультат.Вставить(3,Строки[0].ОтапливаемаяПлощадь);
		ИскомыйРезультат.Вставить(4,Строки[0].СовокупнаяПлощадь);
		
	Иначе
		
		ИскомыйРезультат = Неопределено;
		
	КонецЕсли;
	
	Возврат  ИскомыйРезультат;
	
КонецФункции 

&НаСервере
Процедура СформироватьНаименованиеНаСервере()
	
	СправочникОбъект = ДанныеФормыВЗначение(Объект, Тип("СправочникОбъект.бит_Квартиры"));
	
	СправочникОбъект.СформироватьНаименование();
	
	ЗначениеВДанныеФормы(СправочникОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьОбъект()
	
	Записали = Ложь;
	
	СправочникОбъект = ДанныеФормыВЗначение(Объект, Тип("СправочникОбъект.бит_Квартиры"));
	
	Попытка
		
		СправочникОбъект.Записать();
		
		мКэшЗначений.ЭтоНовый = Ложь;
		Записали              = Истина;
		
	Исключение
		
		// БИТ_ЖКХ 02.03.2015{{
		// Сообщить("Не удалось записать объект """ + СправочникОбъект + """!
		// |" + ОписаниеОшибки(), 60);
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не удалось записать объект """ + СправочникОбъект + """!
		|" + ОписаниеОшибки();
		Сообщение.Сообщить();
		// БИТ_ЖКХ 02.03.2015}}
		
	КонецПопытки;
	
	ЗначениеВДанныеФормы(СправочникОбъект, Объект);
	
	Возврат Записали;
	
КонецФункции

&НаСервере
Функция ПолучитьКвартираНомерКомнатыНаСервере(Квартира)
	
	Возврат Квартира.НомерКомнаты;
	
КонецФункции

&НаСервере
Функция ПолучитьКвартираЧастьПомещенияНаСервере(Квартира)
	
	Возврат Квартира.ЧастьПомещения;
	
КонецФункции

&НаСервере
Функция ПолучитьКвартираНаименованиеНаСервере(Квартира)
	
	Возврат Квартира.Наименование;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуКомнат()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_Комнаты.Наименование КАК Наименование,
	|	бит_Комнаты.НомерКомнаты КАК НомерКомнаты,
	|	бит_СведенияОКомнатеСрезПоследних.Высота,
	|	бит_СведенияОКомнатеСрезПоследних.Площадь,
	|	бит_Комнаты.Владелец КАК Владелец,
	|	бит_Комнаты.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА бит_Комнаты.ПометкаУдаления
	|			ТОГДА 2
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК НомерКартинки
	|ИЗ
	|	Справочник.бит_Комнаты КАК бит_Комнаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКомнате.СрезПоследних(&Момент, Комната.Владелец = &Владелец) КАК бит_СведенияОКомнатеСрезПоследних
	|		ПО бит_СведенияОКомнатеСрезПоследних.Комната = бит_Комнаты.Ссылка
	|ГДЕ
	|	бит_Комнаты.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Объект.Ссылка);
	Запрос.УстановитьПараметр("Момент"  , НаДату);
	
	ТаблицаЗаписей = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаЗаписей.Количество() > 0 Тогда 
		
		КомнатыКвартиры.Загрузить(ТаблицаЗаписей);
		
	КонецЕсли;
	
	КомнатыКвартиры.Сортировать("НомерКомнаты Возр");
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Функция ПометитьКомнатуНаУдалениеНаСервере(Знач Ссылка)
	
	ОбъектКомнаты = Ссылка.ПолучитьОбъект();
	
	ОбъектКомнаты.ПометкаУдаления = Истина;
	
	Попытка
		
		ОбъектКомнаты.Записать();
		
		Возврат Истина;
		
	Исключение
		
		// БИТ_ЖКХ 02.03.2015{{
		// Сообщить(ОписаниеОшибки());
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить();
		// БИТ_ЖКХ 02.03.2015}}
		
		Возврат Ложь;
		
	КонецПопытки;
	
КонецФункции

&НаСервере
Функция СнятьКомнатуСПометкиНаУдалениеНаСервере(Знач Ссылка)
	
	ОбъектКомнаты = Ссылка.ПолучитьОбъект();
	
	ОбъектКомнаты.ПометкаУдаления = Ложь;
	
	Попытка
		
		ОбъектКомнаты.Записать();
		
		Возврат Истина;
		
	Исключение
		
		// БИТ_ЖКХ 02.03.2015{{
		// Сообщить(ОписаниеОшибки());
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить();
		// БИТ_ЖКХ 02.03.2015}}
		
		Возврат Ложь;
		
	КонецПопытки;
	
КонецФункции

&НаСервере
Процедура ЗаписатьНаСервере()
	
	СправочникОбъект = РеквизитФормыВЗначение("Объект");
	
	СправочникОбъект.Записать();	
	
	// БИТ_ЖКХ 18.02.2016 17:23:33 Начало правки... 
	ЗначениеВРеквизитФормы(СправочникОбъект,"Объект");
	// БИТ_ЖКХ 18.02.2016 17:23:34 Конец правки. 
	
	мКэшЗначений.ЭтоНовый = Ложь; 
	
	УстановитьОтборы();
	ЗаполнитьТаблицуКомнат();
	ПосчитатьПлощади();
	
КонецПроцедуры

// БИТ_ЖКХ 03.04.2014
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// БИТ_ЖКХ 11.03.2016 13:23:02 Начало правки...
	НаборСведенияОКвартире = РегистрыСведений.бит_СведенияОКвартире.СоздатьНаборЗаписей();
	НаборСведенияОКвартире.Отбор.Квартира.Установить(ТекущийОбъект.Ссылка);
	НаборСведенияОКвартире.Прочитать();
	Если НаборСведенияОКвартире.Количество() = 0 Тогда
		СоздатьЗапись = Истина;
	Иначе
		СоздатьЗапись = Ложь;
	КонецЕсли;
	// БИТ_ЖКХ 11.03.2016 13:23:04 Конец правки. 
	
	Попытка
		ТекущийОбъект.Записать();
	Исключение
		СоздатьЗапись = Ложь;
	КонецПопытки;
	
	Если СоздатьЗапись Тогда
		
		
		НовыйНабор = РегистрыСведений.бит_СведенияОКвартире.СоздатьНаборЗаписей();
		НовыйНабор.Отбор.Квартира.Установить(ТекущийОбъект.Ссылка);
		НовыйНабор.Прочитать();
		
		НоваяЗапись = НовыйНабор.Добавить();
		
		НоваяЗапись.Период         = НаДату;
		НоваяЗапись.Квартира       = ТекущийОбъект.Ссылка;
		НоваяЗапись.СтатусКвартиры = Справочники.бит_СтатусыКвартиры.Приватизированная;
		НоваяЗапись.ТипКвартиры    = Справочники.бит_ТипыКвартиры.Отдельная;
		
		Попытка
			НовыйНабор.Записать();
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры
// БИТ_ЖКХ 03.04.2014

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьКэшЗначений(мКэшЗначений);
	Если Параметры.Свойство("НежилыеПомещения") Тогда
		мКэшЗначений.ТипКвартиры = Параметры.НежилыеПомещения;
	КонецЕсли;
	// вызов механизма разделения прав доступа
	СправочникОбъект = РеквизитФормыВЗначение("Объект");
	
	//бит_ПраваДоступа.ПередОткрытиемФормы(Отказ,СтандартнаяОбработка,СправочникОбъект,ЭтаФорма);
	
	Если Параметры.Свойство("НаДату") Тогда
		
		НаДату = Параметры.НаДату;
		
	Иначе
		
		НаДату = ТекущаяДата();
		
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьОтборы();
	ЗаполнитьТаблицуКомнат();
	ПосчитатьПлощади();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеДляКвартиры" 
		И Источник = Объект.Ссылка Тогда
		
		Элементы.СведенияОКвартире.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// БИТ_ЖКХ 09.09.2016 11:55:28 Начало правки...
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	// БИТ_ЖКХ 09.09.2016 11:55:28 Конец правки.
	
	Оповестить("ИзменениеКвартирыДляЛС", Объект.Ссылка, );
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	мКэшЗначений.ЭтоНовый = Ложь; 
	
	УстановитьОтборы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	
	ЗаполнитьТаблицуКомнат();
	ПосчитатьПлощади();
	
КонецПроцедуры

&НаКлиенте
Процедура КомнатыКвартирыРегистрСведенийбит_СведенияОКомнатеОткрытьПоЗначениюКомната(Команда)
	
	ТекущиеДанные = Элементы.КомнатыКвартиры.ТекущиеДанные;
	
	Если Не ТекущиеДанные = Неопределено Тогда
		
		Отбор = Новый Структура;		
		
		Отбор.Вставить("Комната", ТекущиеДанные.Ссылка);
		
		ОткрытьФорму("РегистрСведений.бит_СведенияОКомнате.Форма.ФормаСпискаУправляемая", Новый Структура("Отбор", Отбор), ЭтаФорма); 
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НомерКвартирыПриИзменении(Элемент)
	
	СформироватьНаименованиеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрефиксКвартирыПриИзменении(Элемент)
	
	СформироватьНаименованиеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрефиксКвартирыОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	ПервыйСимвол = Лев(Текст,1);
	
	Если мКэшЗначений.СписокЦифр.НайтиПоЗначению(КодСимвола(ПервыйСимвол)) <> Неопределено Тогда
		
		// БИТ_ЖКХ 02.03.2015{{
		// Сообщить("Префикс не может начинаться с цифры.");
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Префикс не может начинаться с цифры.";
		Сообщение.Сообщить();
		// БИТ_ЖКХ 02.03.2015}}
		
		Объект.ПрефиксКвартиры = "";	
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыСведенияОКвартире

&НаКлиенте
Процедура СведенияОКвартиреПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	Если мКэшЗначений.ЭтоНовый Тогда
		
		Ответ = Неопределено;

		ПоказатьВопрос(Новый ОписаниеОповещения("СведенияОКвартиреПередНачаломДобавленияЗавершение", ЭтотОбъект, Новый Структура("Копирование", Копирование)), "Элемент еще не записан. Записать?", РежимДиалогаВопрос.ОКОтмена);
		
	КонецЕсли;
	
	// БИТ_ЖКХ 02.03.2016 15:11:48 Начало правки... 
	СведенияОКвартиреПередНачаломДобавленияФрагмент(Копирование);
	// БИТ_ЖКХ 02.03.2016 15:11:53 Конец правки. 
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияОКвартиреПередНачаломДобавленияЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Копирование = ДополнительныеПараметры.Копирование;
    
    Ответ = РезультатВопроса;
    
    Если Ответ = КодВозвратаДиалога.ОК Тогда
        
        Попытка
            
            Записан = ЗаписатьОбъект();
			
			Если НЕ Записан Тогда
				
				Возврат;
				
			КонецЕсли;	
			
            УстановитьОтборы();
			
			СведенияОКвартиреПередНачаломДобавленияФрагмент(Копирование);
            
        Исключение
            
        КонецПопытки;
        
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СведенияОКвартиреПередНачаломДобавленияФрагмент(Знач Копирование)
    
    Перем ЗначенияЗаполнения, ТекущиеДанные;
    
    ЗначенияЗаполнения = Новый Структура;
    
    ЗначенияЗаполнения.Вставить("Квартира", Объект.Ссылка);
    ЗначенияЗаполнения.Вставить("ТипКвартиры", мКэшЗначений.ТипКвартиры);
    
    Если Копирование Тогда
        
        ТекущиеДанные = Элементы.СведенияОКвартире.ТекущиеДанные;
        
        Если ТекущиеДанные <> Неопределено Тогда
            
            ЗначенияЗаполнения.Вставить("Период"					, ТекущиеДанные.Период);
            ЗначенияЗаполнения.Вставить("ОбщаяПлощадь"				, ТекущиеДанные.ОбщаяПлощадь);
            ЗначенияЗаполнения.Вставить("ЖилаяПлощадь"				, ТекущиеДанные.ЖилаяПлощадь);
            ЗначенияЗаполнения.Вставить("МОП"						, ТекущиеДанные.МОП);
            ЗначенияЗаполнения.Вставить("ОтапливаемаяПлощадь"		, ТекущиеДанные.ОтапливаемаяПлощадь);
            ЗначенияЗаполнения.Вставить("СовокупнаяПлощадь"			, ТекущиеДанные.СовокупнаяПлощадь);
            ЗначенияЗаполнения.Вставить("ТипКвартиры"				, ТекущиеДанные.ТипКвартиры);
            ЗначенияЗаполнения.Вставить("СтатусКвартиры"			, ТекущиеДанные.СтатусКвартиры);
            ЗначенияЗаполнения.Вставить("ТипПлиты"					, ТекущиеДанные.ТипПлиты);
            ЗначенияЗаполнения.Вставить("ТипЗапирающегоУстройства"	, ТекущиеДанные.ТипЗапирающегоУстройства);
            // БИТ_ЖКХ_17012014_начало_изменений
            ЗначенияЗаполнения.Вставить("ЖилоеПомещениеСпециализированногоЖилищногоФонда", ТекущиеДанные.ЖилоеПомещениеСпециализированногоЖилищногоФонда);
            // БИТ_ЖКХ_17012014_окончание_изменений
			// БИТ_ЖКХ 25.04.2017 15:26:42 Начало правки...
			//ЗначенияЗаполнения.Вставить("ПлощадьОДНСОИЭлектроснаб"	, ТекущиеДанные.ПлощадьОДНСОИЭлектроснаб);
			//ЗначенияЗаполнения.Вставить("ПлощадьОДНСОИВодоснаб"		, ТекущиеДанные.ПлощадьОДНСОИВодоснаб);
			// БИТ_ЖКХ 25.04.2017 15:26:42 Конец правки.
        КонецЕсли;
        
    КонецЕсли;
    
    ОткрытьФорму("РегистрСведений.бит_СведенияОКвартире.Форма.ФормаЗаписиУправляемая", Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения), ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура СведенияОКвартиреПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	УстановитьОтборы();
КонецПроцедуры

&НаКлиенте
Процедура СведенияОКвартиреПриИзменении(Элемент)
	
	ЗаписатьНаСервере();
	
	УстановитьОтборы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыКомнатыКвартиры

&НаКлиенте
Процедура КомнатыКвартирыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	Основание = Новый Структура;
	
	Основание.Вставить("Владелец", Объект.Ссылка);
	
	Если Копирование Тогда
		
		ТекДанные = Элементы.КомнатыКвартиры.ТекущиеДанные;
		
		Если НЕ ТекДанные = Неопределено Тогда
			
			НомерКомнаты    = ПолучитьКвартираНомерКомнатыНаСервере(ТекДанные.Ссылка);
			ЧастьПомещения  = ПолучитьКвартираЧастьПомещенияНаСервере(ТекДанные.Ссылка);
			НаименованиеКом = ПолучитьКвартираНаименованиеНаСервере(ТекДанные.Ссылка);
			
			Основание.Вставить("НомерКомнаты"  , НомерКомнаты);
			Основание.Вставить("ЧастьПомещения", ЧастьПомещения);
			Основание.Вставить("Наименование"  , НаименованиеКом);
			
		КонецЕсли;
		
	КонецЕсли; 
	
	ПараметрыФормы = Новый Структура("Основание, НаДату", Основание, НаДату);
	
	ОткрытьФорму("Справочник.бит_Комнаты.Форма.ФормаЭлементаУправляемая", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура КомнатыКвартирыПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТекущиеДанные = Элементы.КомнатыКвартиры.ТекущиеДанные;
	
	Если ТекущиеДанные.НомерКартинки = 1 Тогда
		
		Ответ = Неопределено;
		
		
		ПоказатьВопрос(Новый ОписаниеОповещения("КомнатыКвартирыПередУдалениемЗавершение1", ЭтотОбъект, Новый Структура("ТекущиеДанные", ТекущиеДанные)), "Пометить элемент на удаление?", РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ПоказатьВопрос(Новый ОписаниеОповещения("КомнатыКвартирыПередУдалениемЗавершение", ЭтотОбъект, Новый Структура("Ответ, ТекущиеДанные", Ответ, ТекущиеДанные)), "Снять с элемента пометку на удаление?", РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомнатыКвартирыПередУдалениемЗавершение1(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
	
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Результат = ПометитьКомнатуНаУдалениеНаСервере(ТекущиеДанные.Ссылка);
		
		Если Результат Тогда
			
			ТекущиеДанные.НомерКартинки = 2;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомнатыКвартирыПередУдалениемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = ДополнительныеПараметры.Ответ;
	ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
	
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Результат = СнятьКомнатуСПометкиНаУдалениеНаСервере(ТекущиеДанные.Ссылка);
		
		Если Результат Тогда
			
			ТекущиеДанные.НомерКартинки = 1;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомнатыКвартирыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ПосчитатьПлощади();
	
КонецПроцедуры

&НаКлиенте
Процедура КомнатыКвартирыНаименованиеОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.КомнатыКвартиры.ТекущиеДанные;
	
	Элементы.КомнатыКвартиры.Доступность = Ложь;
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("Ключ"  , ТекДанные.Ссылка);
	ПараметрыФормы.Вставить("НаДату", НаДату);
	
	ОткрытьФорму("Справочник.бит_Комнаты.Форма.ФормаЭлементаУправляемая", ПараметрыФормы);
	
	Элементы.КомнатыКвартиры.Доступность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура КомнатыКвартирыПлощадьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.КомнатыКвартиры.ТекущиеДанные;
	
	Комната = ТекущиеДанные.Ссылка;
	
	Запись = бит_ОбщегоНазначения.ПолучитьСведенияОКомнате(Комната, НаДату);
	
	бит_ОбщегоНазначения.ИзменитьДанныеОКомнате(Запись, "Площадь", ТекущиеДанные.Площадь);
	
КонецПроцедуры

&НаКлиенте
Процедура КомнатыКвартирыВысотаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.КомнатыКвартиры.ТекущиеДанные;
	
	Комната = ТекущиеДанные.Ссылка;
	
	Запись = бит_ОбщегоНазначения.ПолучитьСведенияОКомнате(Комната, НаДату);
	
	бит_ОбщегоНазначения.ИзменитьДанныеОКомнате(Запись, "Высота", ТекущиеДанные.Высота);
	
КонецПроцедуры

#КонецОбласти
